Tekla Open API Reference for Tekla Structures 2025
Point.HASH_SEED Field
 A default seed value for creating hash codes.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly int HASH_SEED
Public Shared ReadOnly HASH_SEED As Integer
Field Value
Type: Int32
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace